#正向递增索引

s= 'helloworld'
for i in range(0,len(s)):
    print(i,s[i],end='\t\t')
print('\n--------------------------------------------------------------------------------------')

#逆向递减索引
for i in range(-len(s),0):
    print(i,s[i],end='\t\t')

print('\n--------------------------------------------------------------------------------------')
print(s[9],s[-1])


print('\n--------------------------------------------------------------------------------------')
#切片操作
s1 = s[0:5:2]  #从0开始，从4结束 步长为2
print(s1)

#省略开始位置 默认从0开始
print(s[:5:1])
#省略开始位置 省略步长
print(s[:5:])

#省略结束位置
print(s[0::1])   #默认最后一个元素  包含最后一个元素

print(s[5::])
print(s[5:])     #与上一行功能相同

print(s[0:5:2])
print(s[::2])

#步长为负数
print(s[::-1])  #可以使用哪句代码替换
print(s[-1:-11:-1])